Revit 2027 API
UIDocument.SaveAs Method
Overload List
Name | Description
SaveAs() |  Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists.
SaveAs(UISaveAsOptions) |  Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists.
Top
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace